In [20]:
news = "/home/yoonsen/word_graphs/book_news_word_pairs.db"

In [19]:
books = "/home/yoonsen/word_graphs/book_word_pairs.db"

In [9]:
import sqlite3
import pandas as pd

In [7]:
def query(db, sql, params=()):
    with sqlite3.connect(db) as con:
        cur = con.cursor()
        res = cur.execute(sql, params).fetchall()
    return res

def pdquery(db, sql, params=()):
    with sqlite3.connect(db) as con:
        res = pd.read_sql(sql, con, params = params)
    return res

In [23]:
pdquery(news, "select * from sqlite_master").style